app/views/carts/show.html.erb

SELECT  "itemcarts".* FROM "itemcarts" WHERE "itemcarts"."cart_id" = $1 AND "itemcarts"."item_id" = $2 ORDER BY "itemcarts"."id" ASC LIMIT $3  [["cart_id", 5], ["item_id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <%= item.price%> €<br>
  <% @itemcarts = Itemcart.where(cart: current_user.cart) %>
  <% @itemcart = @itemcarts.where(item: Item.find(item.id)) %>