app/views/order_mailer/admin_order_email.html.erb

SELECT "items".* FROM "items" INNER JOIN "orderitems" ON "items"."id" = "orderitems"."item_id" WHERE "orderitems"."order_id" = $1  [["order_id", 17]]
---
    </tr>
      <% @order.items.each do |item| %>