app/controllers/application_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2019-11-25 21:40:21.740430"], ["updated_at", "2019-11-25 21:40:21.740430"]]
UPDATE "users" SET "cart_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cart_id", 1], ["updated_at", "2019-11-25 21:40:21.769988"], ["id", 1]]
---
  def current_cart
     if current_user && current_user.cart == nil
      @current_cart = Cart.create(user: current_user)
      current_user.update(cart: @current_cart)