app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]
---
  def destroy
    @cart.destroy