app/controllers/itemcart_controller.rb

  def create
    @itemcartforid = Itemcart.create(cart: current_user.cart, item: Item.find(params[:item_id]))
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "itemcarts" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 1], ["item_id", 1], ["created_at", "2019-11-25 21:40:32.536420"], ["updated_at", "2019-11-25 21:40:32.536420"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @itemcart = Itemcart.find(params[:id])
    @itemcart.destroy
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "itemcarts".* FROM "itemcarts" WHERE "itemcarts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "itemcarts" WHERE "itemcarts"."id" = $1  [["id", 1]]