app/controllers/orderitem_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1  [["cart_id", 5]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2019-11-27 15:35:10.148427"], ["updated_at", "2019-11-27 15:35:10.148427"]]
SELECT "items".* FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1  [["cart_id", 2]]
INSERT INTO "orderitems" ("order_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 1], ["item_id", 1], ["created_at", "2019-11-27 15:35:10.170682"], ["updated_at", "2019-11-27 15:35:10.170682"]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2019-11-28 12:30:24.096087"], ["updated_at", "2019-11-28 12:30:24.096087"]]
DELETE FROM "itemcarts" WHERE "itemcarts"."id" = $1  [["id", 2]]
SELECT  "itemcarts".* FROM "itemcarts" WHERE "itemcarts"."cart_id" = $1 AND "itemcarts"."item_id" = $2 LIMIT $3  [["cart_id", 1], ["item_id", 1], ["LIMIT", 1]]
---
  def create
      amount = 0
      current_user.cart.items.each do |item|
        amount += item.price
      end
      @amount = (amount * 100).round

      customer = Stripe::Customer.create({
        email: params[:stripeEmail],
        source: params[:stripeToken],
      })

      charge = Stripe::Charge.create({
        customer: customer.id,
        amount: @amount,
        description: 'Rails Stripe customer',
        currency: 'eur',
      })

      order = Order.create(user: current_user)
      current_user.cart.items.each do |item|
        Orderitem.create(order: order, item: item)
        Itemcart.find_by(cart: current_user.cart, item: item).destroy