app/controllers/orderitem_controller.rb

INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2019-11-26 16:00:27.827526"], ["updated_at", "2019-11-26 16:00:27.827526"]]
INSERT INTO "orderitems" ("order_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 2], ["item_id", 2], ["created_at", "2019-11-26 16:00:27.921500"], ["updated_at", "2019-11-26 16:00:27.921500"]]
DELETE FROM "itemcarts" WHERE "itemcarts"."id" = $1  [["id", 6]]
SELECT  "itemcarts".* FROM "itemcarts" WHERE "itemcarts"."cart_id" = $1 AND "itemcarts"."item_id" = $2 LIMIT $3  [["cart_id", 5], ["item_id", 2], ["LIMIT", 1]]
---
  def create
      order = Order.create(user: current_user)
      current_user.cart.items.each do |item|
        Orderitem.create(order: order, item: item)
        Itemcart.find_by(cart: current_user.cart, item: item).destroy