app/controllers/order_controller.rb

  def create
    current_user.cart.items.each do |item|
      Order.create(user: current_user, item: item)
      Itemcart.find_by(cart: current_user.cart, item: item).destroy
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1  [["cart_id", 5]]
INSERT INTO "orders" ("user_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["item_id", 1], ["created_at", "2019-11-26 13:59:27.181601"], ["updated_at", "2019-11-26 13:59:27.181601"]]
DELETE FROM "itemcarts" WHERE "itemcarts"."id" = $1  [["id", 5]]
SELECT  "itemcarts".* FROM "itemcarts" WHERE "itemcarts"."cart_id" = $1 AND "itemcarts"."item_id" = $2 LIMIT $3  [["cart_id", 5], ["item_id", 1], ["LIMIT", 1]]