app/views/layouts/_navbar.html.erb

                 <span style="font-size: 30px; line-height:30px;">
                <i class="fas fa-shopping-basket"></i><small class="text-light"> (<%=current_user.cart.items.length %>)</small>
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1  [["cart_id", 6]]